cmsis-svd/cmsis-svd/data/NXP/LPC55S6x.svd
        <register>
          <name>PLL_SIC_CLR</name>
          <description>USB PHY PLL Control/Status Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xD12000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>Enables the USB clock from PLL to USB PHY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>Power up the USB PLL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>Enables the clock output from the USB PLL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power down select.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Selects PLL_POWER to control the reference bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Selects REFBIAS_PWD to control the reference bias</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down the reference bias This bit is only used when REFBIAS_PWD_SEL is set to 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>This field controls the USB PLL regulator, set to enable the regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>This field controls the USB PLL feedback loop divider</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Divide by 13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Divide by 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Divide by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Divide by 20</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>Divide by 22</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>Divide by 25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>Divide by 30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Divide by 240</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PREDIV</name>
              <description>This is selection between /1 or /2 to expand the range of ref input clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>PLL is not currently locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PLL is currently locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SIC_TOG</name>
          <description>USB PHY PLL Control/Status Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xD12000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>Enables the USB clock from PLL to USB PHY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>Power up the USB PLL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>Enables the clock output from the USB PLL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power down select.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Selects PLL_POWER to control the reference bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Selects REFBIAS_PWD to control the reference bias</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down the reference bias This bit is only used when REFBIAS_PWD_SEL is set to 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>This field controls the USB PLL regulator, set to enable the regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>This field controls the USB PLL feedback loop divider</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Divide by 13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Divide by 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Divide by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Divide by 20</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>Divide by 22</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>Divide by 25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>Divide by 30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Divide by 240</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PREDIV</name>
              <description>This is selection between /1 or /2 to expand the range of ref input clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>PLL is not currently locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PLL is currently locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
